app/views/carts/confirm.html.erb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]
---
<%= session[:cart].each do |item| %>
<% product=Product.find item["product_id"] %>