app/controllers/products_controller.rb

  def bycategory
    @category=Category.find_by :categoryName => params[:category].capitalize
---
SELECT  "categories".* FROM "categories" WHERE "categories"."categoryName" = $1 LIMIT $2  [["categoryName", "Men"], ["LIMIT", 1]]

  def show
    @product=Product.find params[:id]
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 94], ["LIMIT", 1]]