app/views/layouts/application.html.erb

SELECT "categories".* FROM "categories"
SELECT "sub_categories".* FROM "sub_categories" WHERE "sub_categories"."category_id" = $1  [["category_id", "34"]]
---
<div class="subcatnav" id='navbar'>
<% Category.all.each do |category| %>
<div class='<%= category.categoryName %>'>
  <% category.sub_categories.each do |sub| %>